{
  "broadArea": {
    "name": "Electrical Engineering",
    "link": "https://www.vlab.co.in/broad-area-electrical-engineering",
    "code": "EE"
  },
  "lab": "Virtual High Voltage Laboratory",
  "lab_display_name": "Virtual High Voltage Laboratory",
  "phase": 2,
  "collegeName": "IITKGP",
  "baseUrl": "vhv-iitkgp.vlabs.ac.in",
  "introduction": "Today, the quality of life has reached such a state, that our living is practically unthinkable without electricity. Electricity is, perhaps, the third most important commodity, coming next only to air and water, for the existence of life. All of us are aware that load centers are usually far away from the generating stations, which are located in remote areas depending on the type of generation. To avoid unnecessary losses over long distances, power is invariably transmitted at higher voltages. In fact, the country is entering a stage where transmission has reached Ultra High-Voltage (UHV) levels. All this necessitates the development of appropriate insulation materials and their use in High Voltage power apparatus. There assessment calls for a High-Voltage laboratory. A high-Voltage laboratory needs to be established to carry out fundamental studies on insulating materials, to carry out the performance evaluation of proto types and also to assess the condition of High-Voltage power apparatus before their erection and installation. So what comprises a High-Voltage Laboratory? As most of the power generation, transmission and utilization employ alternating voltages, any laboratory should have a high voltage alternating source with associated measuring equipment. Moreover, any power apparatus faces transient over voltages, which could be external (atmospheric or lightning) or internal (System generated or switching), and therefore needs to be assessed for them. This aspect is studied by having Impulse Voltage Generators (IVG) and Impulse Current Generators (ICG).<br><br><b>Why Virtual High Voltage Laboratory?</b><br>Digital computers are universal machines that can simulate any machine or any process that can be precisely described. Engineers use advanced computer systems to build and study working simulations. Laboratory experiences are essential to learning in all areas of engineering. Most of the benefits of a traditional laboratory can be captured in a virtual laboratory. Moreover, the virtual laboratory has some educational advantages not available in the traditional laboratory. Virtual High Voltage Laboratory (VHVL) is an implementation of this concept in the field of high voltage engineering. VHVL deals with standard voltage & current generation (DC and AC both), insulation tests of various power apparatus viz. impulse voltage testing (power cables, power and instrument transformers), impulse current testing (surge arresters, power transformers) and rectangular impulse current testing (surge arresters). Here at Virtual High Voltage Lab the user will use this property of digital computers to 'learn by discovery'. Virtual High Voltage Laboratory is a 'virtual laboratory' where the user will discover scientific principles which can be discovered by performing simulated laboratory experiments. These simulations can supplement actual experiments in student laboratories or serve as traditional homework. Sometimes the experiments performed by the user will be tightly controlled and lead the user by hand as user interrogates simulations,complete tables and graph results. Most exercises in Virtual High Voltage Laboratory are divided into two sections: 'Experiments' and 'Models'. 'Experiments' display what appears to be actual laboratory equipment that can be manipulated with the keyboard and mouse to perform a simulated experiment. 'Models' permit use of standard problem-solving tools to build users own simulations. It can act as a good tool for teaching and enable a student to understand the influence of circuit parameters on the output waveshape. Also it can serve as a guide for the testing engineer to arrive at the values of the generator parameters for impulse testing of various power apparatuses and simulate tests. <br>While accessing Virtual High Voltage Laboratory user will have the feel of real laboratory because of the animation of the experiments performed, user can take help of manual, user can ask his problems to VHVL developers via e-mail and in the end of every experiment user will face a brain teaser quiz.",
    "experiments": [
  {
    "name": "Study Of Impulse Voltage Generator",
    "short-name": "impulse-voltage-generator",
    "repo": "https://github.com/virtual-labs/exp-impulse-voltage-generator-iitkgp",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Parametric Analysis Of Impulse Voltage Waveform",
    "short-name": "parametric-voltage-waveform",
    "repo": "https://github.com/virtual-labs/exp-parametric-voltage-waveform-iitkgp",
    "tag": "v1.0.1",
    "deploy": true
  },
  {
    "name": "Study Of Impulse Current Generator",
    "short-name": "impulse-current-generator",
    "repo": "https://github.com/virtual-labs/exp-impulse-current-generator-iitkgp",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Parametric Analysis Of Impulse Current Waveform",
    "short-name": "parametric-impulse-waveform",
    "repo": "https://github.com/virtual-labs/exp-parametric-impulse-waveform-iitkgp",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Critical Flashover of a Sphere Gap using IVG",
    "short-name": "critical-flashover-ivg",
    "repo": "https://github.com/virtual-labs/exp-critical-flashover-ivg-iitkgp",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Study of Rectangular Pulse Current Generator",
    "short-name": "rectangular-pulse-generator",
    "repo": "https://github.com/virtual-labs/exp-rectangular-pulse-generator-iitkgp",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Functioning of Voltage Doubler",
    "short-name": "functioning-voltage-doubler",
    "repo": "https://github.com/virtual-labs/exp-functioning-voltage-doubler-iitkgp",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "3-Stage Cockroft Walton Voltage Multiplier",
    "short-name": "cockroft-walton-voltage",
    "repo": "https://github.com/virtual-labs/exp-cockroft-walton-voltage-iitkgp",
    "tag": "v1.0.0",
    "deploy": true
  }

    ],
    "targetAudience": {
        "UG": [
            "Undergraduate students of Electrical Engineering"
        ],
      "PG": [
        "Post-graduate students of Electrical Engineering"
      ]
    },
    "objective": "<ul><li>To build the confidence of the user to work in an actual high voltage laboratory.</li><li>To realize importance and necessity of a High Voltage Laboratory.</li><li>To understand various types of high voltages (viz. ac, dc and impulse) and their importance.</li><li>To understand and assimilate the concepts of high voltage engineering.</li><li>To provide an effective platform to study the effect of variation of circuit parameters on any high voltage circuit.</li><li>To provide an easy access to experimental applications anytime, anyplace, independent of platform making learning a pleasure</li></ul>",
    "courseAlignment": {
        "description": "The lab contents are chosen such that it covers the syllabi of the Electrical Engineering course's of various universities."
    }
}
